SICP.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-25 mié 11:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeb6979c">1. The Substitution Model for Procedure Application</a>
<ul>
<li><a href="#orgaaefbab">1.1. There are two points that should be stressed:</a></li>
</ul>
</li>
<li><a href="#orga64e4c9">2. Linear recursion and iteration</a>
<ul>
<li><a href="#orgc440fe1">2.1. Consider the first process.</a></li>
<li><a href="#orge798bac">2.2. The second process</a></li>
</ul>
</li>
<li><a href="#org981591c">3. The  contrast between the two processes can be seen in another way.</a>
<ul>
<li><a href="#orgf69b97b">3.1. When we describe a <b>procedure</b> as recursive,</a></li>
<li><a href="#org50761b7">3.2. When we describe a <b>process</b> as following a pattern</a></li>
<li><a href="#org347f8d3">3.3. One reason that the distinction between process and procedure may be confusing is</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb6979c" class="outline-2">
<h2 id="orgeb6979c"><span class="section-number-2">1</span> The Substitution Model for Procedure Application</h2>
<div class="outline-text-2" id="text-1">
<p>
the interpreter evaluates the elements of the combination and applies the procedure 
(which is the value of the operator of the combination)
</p>

<p>
to the arguments 
(which are the values of the operands of the combination). 
</p>

<p>
To apply a compound procedure to arguments, 
evaluate the body of the procedure with each formal parameter 
replaced by the corresponding argument. 
</p>


<div class="org-src-container">
<pre class="src src-scheme">(f 5)

</pre>
</div>

<p>
We begin by retrieving the body of f:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(sum-of-squares (+ a 1) (* a 2))

</pre>
</div>


<p>
Then we replace the formal parameter a by the argument 5:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(sum-of-squares (+ 5 1) (* 5 2))

</pre>
</div>


<p>
Thus the problem reduces to the evaluation of 
a combination with two operands and an operator sum-of-squares. 
</p>

<p>
Evaluating this combination involves three subproblems.
</p>

<p>
We must evaluate the operator to get the procedure to be applied, 
and we must evaluate the operands to get the arguments. 
</p>

<p>
Now (+ 5 1) produces 6 
and (* 5 2) produces 10,
</p>

<p>
so we must apply the sum-of-squares procedure to 6 and 10. 
</p>

<p>
These values are substituted for the formal parameters x and y in the body of sum-of-squares,
reducing the expression to
</p>

<div class="org-src-container">
<pre class="src src-scheme">(+ (square 6) (square 10))

</pre>
</div>


<p>
If we use the definition of square, this reduces to
</p>

<div class="org-src-container">
<pre class="src src-scheme">(+ (* 6 6) (* 10 10))

</pre>
</div>


<p>
which reduces by multiplication to
</p>

<div class="org-src-container">
<pre class="src src-scheme">(+ 36 100)

</pre>
</div>


<p>
and finally to
</p>

<div class="org-src-container">
<pre class="src src-scheme">136

</pre>
</div>
</div>


<div id="outline-container-orgaaefbab" class="outline-3">
<h3 id="orgaaefbab"><span class="section-number-3">1.1</span> There are two points that should be stressed:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The purpose of the substitution is to help us think about procedure application, 
<b>not to provide a description of how the interpreter really works.</b>
</p>

<p>
In general, when modeling phenomena in science and engineering, we begin with simplified,
incomplete models. 
</p>

<p>
As we examine things in greater detail, these simple models become inadequate and must be 
replaced by more refined models. The substitution model is no exception. 
</p>

<p>
In particular, when we address in Chapter 3 the use of procedures with “mutable data,”
we will see that the substitution model breaks down and must be replaced by a more 
complicated model of procedure application.
</p>
</div>
</div>
</div>


<div id="outline-container-orga64e4c9" class="outline-2">
<h2 id="orga64e4c9"><span class="section-number-2">2</span> Linear recursion and iteration</h2>
<div class="outline-text-2" id="text-2">
<p>
factorial function:
</p>

\begin{equation}
 x=\sqrt{b}
\end{equation}


\begin{equation}
n ! = n ⋅ ( n − 1 ) ⋅ ( n − 2 ) ⋯ 3 ⋅ 2 ⋅ 1.
\end{equation}

<p>
how to compute factorials?
observation:
n! is equal to n time (n-1)! for any positive integer
</p>

\begin{equation}
 n ! = n ⋅ [ ( n − 1 ) ⋅ ( n − 2 ) ⋯ 3 ⋅ 2 ⋅ 1 ] = n ⋅ ( n − 1 ) ! .
\end{equation}

<p>
thus: we can compute n! by computing (n-1)! and multiplying the result by n
</p>

<p>
let 1! = 1 :
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">factorial</span> n)
 (<span style="color: #b4fa70;">if</span> (= n 1)
      1
      (* n (factorial (- n 1 )))))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(factorial 6)
(* 6 (factorial 5))
(* 6 (* 5 (factorial 4)))
(* 6 (* 5 (* 4 (factorial 3))))
(* 6 (* 5 (* 4 (* 3 (factorial 2)))))
(* 6 (* 5 (* 4 (* 3 (* 2 (factorial 1))))))
(* 6 (* 5 (* 4 (* 3 (* 2 1)))))
(* 6 (* 5 (* 4 (* 3 2))))
(* 6 (* 5 (* 4 6)))
(* 6 (* 5 24))
(* 6 120)
720 

</pre>
</div>

<p>
Another form:  
</p>

<p>
we first multiply 1 by 2, then multiply the result by 4, then by 4, 
and so on until we reach n.
</p>

<p>
the counter and the product simoultaneously change from one step to the next according
to the rule 
</p>

<pre class="example">

product &lt;- counter  * product
counter &lt;- counter + 1

</pre>

<p>
and if n! is the value of the product when the counter exceeds n
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">factorial</span> n)
 (fact-iter 1 1 n))

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">fact-iter</span> product counter max-count)
 (<span style="color: #b4fa70;">if</span> (&gt; counter max-count)
      product
      (fact-iter (* counter product)
                 (+ counter 1)
                 max-count)))

</pre>
</div>

<pre class="example">

(factorial 6)
(fact-iter 1 1 6)
(fact-iter 1 2 6)
(fact-iter 2 3 6)
(fact-iter 6 4 6)
(fact-iter 24 5 6)
(fact-iter 120 6 6)
(fact-iter 720 7 6)
720

</pre>
</div>

<div id="outline-container-orgc440fe1" class="outline-3">
<h3 id="orgc440fe1"><span class="section-number-3">2.1</span> Consider the first process.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The substitution model reveals a shape of expansion followed by contraction, 
</p>

<p>
The expansion occurs as the process builds up a chain of <b>deferred</b> operations 
(in this case, a chain of multiplications). 
</p>

<p>
The contraction occurs as the operations are <b>actually performed</b>.
</p>

<p>
This type of process, characterized by a chain of deferred operations, 
is called a <b>recursive process.</b> 
</p>

<p>
Carrying out this process requires that the interpreter keep track of the operations 
to be performed later on.
</p>

<p>
In the computation of n! , 
the length of the chain of deferred multiplications,
and hence the amount of information needed to keep track of it, 
grows linearly with n ( is proportional to n ), just like the number of steps. 
Such a process is called a <b>linear <span class="underline">recursive</span> process</b>. 
</p>
</div>
</div>


<div id="outline-container-orge798bac" class="outline-3">
<h3 id="orge798bac"><span class="section-number-3">2.2</span> The second process</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Does not grow and shrink.
</p>

<p>
At each step, all we need to keep track of, for any n, 
are the current values of the variables product, counter, and max-count. 
</p>

<p>
We call this an iterative process. 
In general, 
<b>an iterative process is one whose state can be summarized by a fixed number of</b>
<b>state variables</b>,
<b>together with a fixed rule that describes how the state variables should be updated</b> 
<b>as the process moves from state to state</b> 
<b>and an (optional) end test</b>
<b>that specifies conditions under which the process should terminate</b>. 
</p>


<p>
In computing n!, the number of steps required grows linearly with n. 
Such a process is called a <b>linear <span class="underline">iterative</span> process</b>
</p>
</div>
</div>
</div>


<div id="outline-container-org981591c" class="outline-2">
<h2 id="org981591c"><span class="section-number-2">3</span> The  contrast between the two processes can be seen in another way.</h2>
<div class="outline-text-2" id="text-3">
<p>
In the iterative case: 
 the program variables provide a complete description of the state of the process at any point.
If we stopped the computation between steps, 
all we would need to do to resume the computation is to 
supply the interpreter with the values of the three program variables. 
</p>

<p>
Not so with the recursive process. 
In this case there is some additional “hidden” information,
maintained by the interpreter and not contained in the program variables, 
which indicates “where the process is” in negotiating the chain of deferred operations. 
The longer the chain, the more information must be maintained.
</p>

<p>
In contrasting iteration and recursion, we must be careful not to confuse 
the notion of a *recursive <span class="underline">process</span> * 
with the notion of a *recursive <span class="underline">procedure</span> *. 
</p>
</div>


<div id="outline-container-orgf69b97b" class="outline-3">
<h3 id="orgf69b97b"><span class="section-number-3">3.1</span> When we describe a <b>procedure</b> as recursive,</h3>
<div class="outline-text-3" id="text-3-1">
<p>
we are referring to the syntactic fact that the procedure definition refers 
(either directly or indirectly) to <b>the procedure itself</b>. 
</p>
</div>
</div>


<div id="outline-container-org50761b7" class="outline-3">
<h3 id="org50761b7"><span class="section-number-3">3.2</span> When we describe a <b>process</b> as following a pattern</h3>
<div class="outline-text-3" id="text-3-2">
<p>
that is, say, linearly recursive, we are speaking about <b>how the process evolves</b>, 
not about the syntax of how a procedure is written. 
</p>

<p>
It may seem disturbing that we refer to a recursive procedure such as fact-iter 
as generating an iterative process. 
</p>

<p>
However, the process really is iterative: 
Its state is captured completely by its three state variables, 
and an interpreter need keep track of only three variables in order to execute the process.
</p>
</div>
</div>


<div id="outline-container-org347f8d3" class="outline-3">
<h3 id="org347f8d3"><span class="section-number-3">3.3</span> One reason that the distinction between process and procedure may be confusing is</h3>
<div class="outline-text-3" id="text-3-3">
<p>
that most <b>implementations</b> of common languages (including Ada, Pascal, and C) 
are designed in such a way that 
</p>

<p>
<b>the interpretation of any recursive procedure</b>
<b>consumes an amount of memory that grows with the number of procedure calls</b>, 
even when the process described is, in principle, iterative. 
</p>

<p>
As a consequence, 
these languages <b>can describe iterative processes only</b> 
<b>by resorting to special-purpose “looping constructs”</b> 
such as do, repeat, until, for, and while. 
</p>

<p>
The implementation of Scheme we shall consider in Chapter 5 does not share this defect. 
</p>

<p>
<b>It will execute an iterative process in constant space,</b> 
<b>even if the iterative process is described by a recursive procedure</b>.
</p>

<p>
An implementation with this property is called <b>tail-recursive.</b>
</p>

<p>
With a tail-recursive implementation, 
iteration can be expressed using the ordinary procedure call mechanism, 
so that special iteration constructs are useful only as syntactic sugar.
</p>

<p>
Exercise 1.9: 
Each of the following two procedures defines a method for adding two positive
integers in terms of the procedures inc,
which increments its argument by 1, and dec, which decrements its argument by 1. 
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">+</span> a b)
 (<span style="color: #b4fa70;">if</span> (= a 0)
   b
   (inc (+ (dec a) b))))

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">+</span> a b)
 (<span style="color: #b4fa70;">if</span> (= a 0)
   b
   (+ (dec a) (inc b))))

</pre>
</div>

<p>
Using the substitution model, 
illustrate the process generated by each procedure in evaluating (+ 4 5). 
Are these processes iterative or recursive? 
</p>


<pre class="example">
(+ 4 5)



</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-10-25 mié 11:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
